//Дан диаметр окружности d. Найти ее длину L = π·d. В качестве значения π использовать 3.14.

#include <iostream>
using namespace std;
int main()
{
	int d;
	cin >> d;

	cout << "L = " << 3.14 * d;

}

