// 4. Даны координаты точки, не лежащей на координатных осях OX и OY.
// Определить номер координатной четверти, в которой находится данная точка
//

#include <iostream>

using namespace std;

int main()
{
	setlocale(0, "");
	double x, y;

	cout << "Введите х != 0 :"; cin >> x;
	cout << "Введите y != 0 :"; cin >> y;

	if ((x > 0) & (y > 0))
	{
		cout << " 1-я четверть";
	}
	else
	{
		if ((x < 0) & (y > 0))
		{
			cout << " 2-я четверть";
		}
		else
		{
			if ((x < 0) & (y < 0))
			{
				cout << " 3-я четверть";
			}
			else
			{
				cout << " 4-я четверть";
			}
		}
	}
}




